Revit 2026 API

# IFCCategoryTemplate Constructor

---

Custom constructor for this element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IFCCategoryTemplate(
	Document document
)
```
```vb
Public Sub New (
	document As Document
)
```
```cpp
public:
IFCCategoryTemplate(
	Document^ document
)
```
```fsharp
new :
        document : Document -> IFCCategoryTemplate
```

#### Parameters

document Document
     Document where created template is saved.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

IFCCategoryTemplate Class

Autodesk.Revit.DB Namespace